cases/10x7e/RPM_5000/RPM_3000/kOmegaSStUnsteady/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }
	
	walls
	{
		type            zeroGradient;
	}

    propellerTip
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    innerCylinder
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    innerCylinder_slave
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
